basic/modules/attendance/delegate/AttendanceDelegate.php

    public static function getAllAttend($limit,$offset,$data)
    {
        $attendModel = AttendanceModel::find()->leftJoin('oa_members','oa_members.u_id=oa_attendance.u_id')->where('oa_attendance.u_id!=1 and oa_members.is_del!=1');
        if(isset($data['begin_time']) && !empty($data['begin_time'])){
            $begin_time = strtotime($data['begin_time']);
            $attendModel->andWhere(['>=','oa_attendance.onTime',$begin_time]);
            //$checmCountModel->andWhere(['>','oa_checktime.checktime',$begin_time]);
        }

        if(isset($data['end_time']) && !empty($data['end_time'])){
            //$end_time = strtotime(date('Y-m-d', strtotime('+1 day', strtotime($data['end_time']))));
            $end_time = strtotime($data['end_time']);
            $attendModel->andWhere(['<=','oa_attendance.offTime',$end_time]);
            //$checmCountModel->andWhere(['<','oa_checktime.checktime',$end_time]);
        }

        if(isset($data['search_u_id']) && !empty($data['search_u_id'])){
            $attendModel->andWhere('oa_attendance.u_id=:u_id',[':u_id'=>$data['search_u_id']]);
        }else{
            if(isset($data['search_org_id']) && !empty($data['search_org_id'])){
                $orgInfo = OrgModel::find()->where('org_id=:org_id',[':org_id'=>$data['search_org_id']])->asArray()->one();
                $arrOrgChildId = explode(',',$orgInfo['all_children_id']);
                $attendModel->leftJoin('oa_org_member','oa_org_member.u_id=oa_attendance.u_id')->andWhere(['in','oa_org_member.org_id',$arrOrgChildId]);
            }
        }

        $res['attendList'] = $attendModel->offset($offset)->limit($limit)->orderBy('oa_attendance.workDate desc,oa_members.u_id asc')->asArray()->all();
        $res['page']['sumPage'] = ceil($attendModel->count()/$limit);
---
SELECT `oa_attendance`.* FROM `oa_attendance` LEFT JOIN `oa_members` ON oa_members.u_id=oa_attendance.u_id WHERE oa_attendance.u_id!=1 and oa_members.is_del!=1 ORDER BY `oa_attendance`.`workDate` DESC, `oa_members`.`u_id` LIMIT 10
SELECT COUNT(*) FROM `oa_attendance` LEFT JOIN `oa_members` ON oa_members.u_id=oa_attendance.u_id WHERE oa_attendance.u_id!=1 and oa_members.is_del!=1 ORDER BY `oa_attendance`.`workDate` DESC, `oa_members`.`u_id`