basic/modules/task/controllers/TaskController.php

    public function actionGetLeavePoints()
    {
        $leavePoints = MembersModel::find()->where(['u_id'=>$this->userInfo['u_id']])->asArray()->one()['leave_points'];
---
SELECT * FROM `oa_members` WHERE `u_id`=264