basic/modules/userinfo/helper/UserHelper.php

    public static function isManager($uid, $orgId)
    {
        $orgMember = OrgMemberModel::findOne(['u_id' => $uid]);
---
SELECT * FROM `oa_org_member` WHERE `u_id`=264