basic/modules/permission/delegate/PermissionDelegate.php

    public static function getUserPcode($uid, $groupId)
    {
        $pCodeList = [];
//        $pCodeList = Mcache::getCache(self::USER_PERMISSION_CACHE_KEY.$uid);
//        if ($pCodeList) {
//            return $pCodeList;
//        }
        $permissionMember = PermissionMemberModel::find()->select('oa_permission.code')
            ->leftJoin('oa_permission', 'oa_permission.pid=oa_permission_member.pid')
            ->where(['oa_permission_member.u_id' => $uid])
            ->asArray()
            ->all();
---
SELECT `oa_permission`.`code` FROM `oa_permission_member` LEFT JOIN `oa_permission` ON oa_permission.pid=oa_permission_member.pid WHERE `oa_permission_member`.`u_id`=264