basic/modules/survey/delegate/SurveyDelegate.php

    public static function getSurveyList($type=1,$u_id,$limit,$offset)
    {
        $surveyM = SurveyModel::find()->select('oa_survey.*,oa_members.real_name')->leftJoin('oa_members','oa_members.u_id=oa_survey.u_id');
        if($type==2){
            $surveyM->where('oa_survey.u_id=:u_id',[':u_id'=>$u_id]);
        }
        $res['surList'] = $surveyM->offset($offset)->limit($limit)->orderBy('create_time DESC')->asArray()->all();
        $res['page']['sumPage'] = ceil($surveyM->count()/$limit);
---
SELECT `oa_survey`.*, `oa_members`.`real_name` FROM `oa_survey` LEFT JOIN `oa_members` ON oa_members.u_id=oa_survey.u_id ORDER BY `create_time` DESC LIMIT 6
SELECT COUNT(*) FROM `oa_survey` LEFT JOIN `oa_members` ON oa_members.u_id=oa_survey.u_id ORDER BY `create_time` DESC