basic/modules/project/delegate/ProjectDelegate.php

SELECT * FROM `oa_project` WHERE pro_id='150'
---
    public static function getProInfo($pro_id)
    {
        $res = ProjectModel::find()->where('pro_id=:pro_id',[':pro_id'=>$pro_id])->asArray()->one();

SELECT * FROM `oa_task` WHERE (pro_id='150') AND (status!=0)
---
    public static function getProTask($pro_id,$type=0)
    {
        $tModel = TaskModel::find()->where('pro_id=:pro_id',[':pro_id'=>$pro_id]);
        if($type!=0){//不包括待发布的任务
            $tModel->andWhere('status!=:status',[':status'=>0]);
        }
        $res = $tModel->asArray()->all();

SELECT `pm`.*, `m`.`real_name`, `m`.`head_img` FROM `oa_project_member` `pm` LEFT JOIN `oa_members` `m` ON m.u_id=pm.u_id WHERE pm.pro_id='150'
---
    public static function getProMem($pro_id)
    {
        $res = (new Query())->select('pm.*,m.real_name,m.head_img')->from('oa_project_member pm')
            ->leftJoin('oa_members m', 'm.u_id=pm.u_id')
            ->where('pm.pro_id=:pro_id',[':pro_id'=>$pro_id])
            ->all();