basic/modules/workmate/delegate/WorkmateDelegate.php

SELECT `oa_members`.`u_id`, `oa_members`.`real_name`, `oa_members`.`head_img` FROM `oa_org_member` LEFT JOIN `oa_members` ON oa_org_member.u_id=oa_members.u_id WHERE `oa_org_member`.`u_id`=''
---
    public static function getOrgMemberList($orgId, $lately)
    {
        $cacheArray = explode(',', $lately);
        $arrSelect = OrgMemberModel::find()->select('oa_members.u_id,oa_members.real_name,oa_members.head_img')
            ->where(['in', 'oa_org_member.u_id', $cacheArray])
            ->leftJoin('oa_members', 'oa_org_member.u_id=oa_members.u_id')
            ->asArray()
            ->all();