basic/modules/desk/delegate/DeskDelegate.php

SELECT * FROM `oa_desk` WHERE `u_id`=264
---
    public static function getTempletList($uid)
    {
        $deskTemplet = DeskModel::findOne(['u_id' => $uid]);

SELECT `task_id`, `task_title`, `task_type`, `status`, `task_level` FROM `oa_task` WHERE (`charger`=264) AND (status>0) ORDER BY `oa_task`.`status`, `oa_task`.`update_time` DESC, `oa_task`.`create_time` DESC LIMIT 6
---
    public static function getMytask($uid)
    {
        $taskList = TaskModel::find()->select('task_id,task_title,task_type,status,task_level')
            ->where(['charger' => $uid])
            ->andWhere('status>0')
            ->limit(6)
            ->orderBy(['oa_task.status' => SORT_ASC, 'oa_task.update_time' => SORT_DESC,'oa_task.create_time' => SORT_DESC])
            ->asArray()
            ->all();

SELECT `c`.`apply_id`, `c`.`model_id`, `c`.`title`, `c`.`status`, `c`.`create_time`, `b`.`real_name`, `a`.`modeltype` FROM `oa_apply_base` `c` LEFT JOIN `oa_members` `b` ON c.applyer=b.u_id LEFT JOIN `oa_apply_model` `a` ON c.model_id=a.model_id WHERE (`c`.`handler`=264) AND (`c`.`status`=0) ORDER BY `c`.`update_time` DESC, `apply_id` DESC LIMIT 6
---
    public static function getMyApproval($uid)
    {
        //我的待办
        $list = (new Query())->select('c.apply_id,c.model_id,c.title,c.status,c.create_time,b.real_name,a.modeltype')
            ->from('oa_apply_base c')
            ->leftJoin('oa_members b', 'c.applyer=b.u_id')
            ->leftJoin('oa_apply_model a', 'c.model_id=a.model_id')
            ->where(['c.handler' => $uid, 'c.status' => 0])
            ->orderBy(['c.update_time' => SORT_DESC, 'apply_id' => SORT_DESC])
            ->limit(6)
            ->all();