basic/models/MembersModel.php

    public static function getUserInfo($uid)
    {
        $user = '';
        $uid = intval($uid);
        //$user = Mcache::getCache(self::USER_INFO_CACHE_KEY.$uid);
        if(!$user){
            $user = self::find()->where('u_id=:u_id and is_del=0',[':u_id'=>$uid])->one();
---
SELECT * FROM `oa_members` WHERE u_id=264 and is_del=0

    public static function getUserOrgInfo($uid,$field=array())
    {
        $M = OrgMemberModel::find();
        if(count($field)>0){
            $M ->select($field);
        }
        return $M ->leftJoin('oa_org', 'oa_org_member.org_id=oa_org.org_id')->where(['oa_org_member.u_id' => $uid])->asArray()->one();
---
SELECT `oa_org_member`.* FROM `oa_org_member` LEFT JOIN `oa_org` ON oa_org_member.org_id=oa_org.org_id WHERE `oa_org_member`.`u_id`=264