basic/models/OrgMemberModel.php

SELECT COUNT(*) FROM (SELECT `oa_members`.`u_id`, `oa_members`.`real_name`, `oa_members`.`head_img` FROM `oa_org_member` LEFT JOIN `oa_org` ON oa_org_member.org_id=oa_org.org_id LEFT JOIN `oa_members` ON oa_members.u_id=oa_org_member.u_id WHERE (`oa_org_member`.`org_id`='38') AND (`oa_members`.`is_del`=0) GROUP BY `oa_members`.`u_id`) `c`
SELECT `oa_members`.`u_id`, `oa_members`.`real_name`, `oa_members`.`head_img` FROM `oa_org_member` LEFT JOIN `oa_org` ON oa_org_member.org_id=oa_org.org_id LEFT JOIN `oa_members` ON oa_members.u_id=oa_org_member.u_id WHERE (`oa_org_member`.`org_id`='38') AND (`oa_members`.`is_del`=0) GROUP BY `oa_members`.`u_id` ORDER BY `oa_members`.`u_id` LIMIT 30
---
    public static function getOrgMemberList($orgId, $page = 1, $pageSize = 30, $file = ['oa_org_member.org_u_id', 'oa_org_member.is_manager', 'oa_org_member.org_id',
        'oa_members.u_id', 'oa_members.real_name', 'oa_members.phone', 'oa_members.email', 'oa_members.resumeId','oa_members.leave_points','oa_members.head_img', 'oa_members.points', 'oa_members.position', 'oa_org.org_name', 'oa_members.u_id'], $realName = '')
    {
        $orgIds = OrgModel::getAllChildrenOrgId($orgId);
        $orgIds[] = $orgId;
        //查询本组所有用户
        $query = self::find()->select($file)
            ->leftJoin('oa_org', 'oa_org_member.org_id=oa_org.org_id')
            ->leftJoin('oa_members', 'oa_members.u_id=oa_org_member.u_id');

        $query->where(['oa_members.status' => 1, 'oa_members.is_del' => 0]);

        if ($orgId != 0) {
            $query->where(['oa_org_member.org_id' => $orgIds,'oa_members.is_del'=>0]);
        }

        if(strlen($realName)>0){
            $query->andWhere(['like','oa_members.real_name',$realName]);
        }
        $totalPage = ceil($query->groupBy('oa_members.u_id')->count()/$pageSize);
        if(!empty($page)) {
            $query->limit($pageSize)->offset(($page-1)*$pageSize)->orderBy(['oa_org_member.is_manager' =>SORT_DESC,'oa_org_member.org_id'=>SORT_ASC,'oa_org_member.u_id'=> SORT_ASC]);
        }
        $list = $query->groupBy('oa_members.u_id')->orderBy('oa_members.u_id asc')->asArray()->all();

SELECT * FROM `oa_org_member` LEFT JOIN `oa_org` ON oa_org_member.org_id=oa_org.org_id WHERE `oa_org_member`.`u_id`='264'
---
    public static function getMemberOrgInfo($uid,$select='*')
    {
        return self::find()->select($select)->leftJoin('oa_org', 'oa_org_member.org_id=oa_org.org_id')->where(['oa_org_member.u_id' => $uid])->asArray()->one();