basic/models/OrgModel.php

SELECT * FROM `oa_org` WHERE `parent_org_id`='38'
---
    public static function getAllChildrenOrgId($orgId, $result = array())
    {
        $orgIdArr = self::find()->where(['parent_org_id' => $orgId])->column();

SELECT `oa_org`.`org_id`, `oa_org`.`org_name` FROM `oa_org` WHERE 1
---
    public static function getOrgInfoList($keyword='',$field='oa_org.org_id,oa_org.org_name', $type=1, $page=0, $pageSize=100)
    {
        $oM = OrgModel::find()->select($field);
        $oM->where('1');
        if(strlen($keyword)>0){
            $oM->andWhere(['like','org_name',$keyword]);
        }
        if(2 == $type){
            $oM->andWhere(["!=",'org_id',2]);
        }
        if ($page) {
            $oM->offset(($page-1) * $pageSize)->limit($pageSize);
        }
        $res = $oM->asArray()->all();