basic/models/TaskModel.php

SELECT `oa_task`.`task_id`, `oa_task`.`create_time`, `oa_project`.`pro_name`, `oa_project`.`pro_id`, `oa_task`.`work_note`, `oa_members`.`head_img`, `oa_task`.`task_type`, `oa_task`.`charger`, `oa_task`.`status`, `oa_task`.`task_level`, `oa_task`.`task_title`, `oa_task`.`task_desc`, `oa_task`.`begin_time`, `oa_task`.`end_time`, `oa_task`.`delay_time`, `oa_task`.`point`, `oa_task`.`is_publish`, `speed`, `quality`, `oa_task`.`reason`, `oa_task`.`is_repoint`, `oa_members`.`real_name`, `oa_reward_task`.`status` AS `rewardStatus`, `oa_task`.`creater` FROM `oa_task` LEFT JOIN `oa_members` ON oa_members.u_id=oa_task.charger LEFT JOIN `oa_reward_task` ON oa_reward_task.task_id=oa_task.task_id LEFT JOIN `oa_project` ON oa_project.pro_id=oa_task.pro_id WHERE `oa_task`.`task_id`='68'
SELECT * FROM `oa_members` WHERE `u_id`='264'
---
    public static function getTaskListDetails($taskId)
    {
        $taskDetailsData = self::find()->select('oa_task.task_id,oa_task.create_time,oa_project.pro_name,oa_project.pro_id,oa_task.work_note,oa_members.head_img, oa_task.task_type,oa_task.charger, oa_task.status, oa_task.task_level, oa_task.task_title, oa_task.task_desc, oa_task.begin_time, oa_task.end_time,oa_task.delay_time,oa_task.point,oa_task.is_publish,speed,quality,oa_task.reason,oa_task.is_repoint,oa_members.real_name, oa_reward_task.status as rewardStatus,oa_task.creater')
                            ->leftJoin('oa_members', 'oa_members.u_id=oa_task.charger')
                            ->leftJoin('oa_reward_task', 'oa_reward_task.task_id=oa_task.task_id')
                            ->leftJoin('oa_project', 'oa_project.pro_id=oa_task.pro_id')
                            ->where(['oa_task.task_id'=>$taskId])->asArray()->one();
        $taskDetailsData['createrName'] = MembersModel::find()->where(['u_id'=>$taskDetailsData['creater']])->asArray()->one()['real_name'];