basic/models/TaskAttachmentModel.php

    public static function getAttachmentFileInfo($taskId, $type = 1, $taskType = 1)
    {
        return self::find()->select('task_att_id, type, task_id, task_type, file_name, real_name, file_path, file_size, file_type, create_time')->where(['task_id'=>$taskId, 'task_type'=>$taskType, 'type' => $type])->asArray()->all();
---
SELECT `task_att_id`, `type`, `task_id`, `task_type`, `file_name`, `real_name`, `file_path`, `file_size`, `file_type`, `create_time` FROM `oa_task_attachment` WHERE (`task_id`='68') AND (`task_type`=1) AND (`type`=1)