basic/models/TaskSkillModel.php

    public static function getTaskSkillRange($taskId, $taskType)
    {
        return self::find()->select('oa_task_skill.task_type, oa_skill.skill_name, oa_skill.skill_id')
                ->leftJoin('oa_skill', 'oa_skill.skill_id=oa_task_skill.skill_id')
                ->where(['oa_task_skill.task_id' => $taskId, 'oa_task_skill.task_type' => $taskType])->asArray()->all();
---
SELECT `oa_task_skill`.`task_type`, `oa_skill`.`skill_name`, `oa_skill`.`skill_id` FROM `oa_task_skill` LEFT JOIN `oa_skill` ON oa_skill.skill_id=oa_task_skill.skill_id WHERE (`oa_task_skill`.`task_id`='68') AND (`oa_task_skill`.`task_type`=1)